tap "homebrew/bundle"
# font-hack
tap "homebrew/cask-fonts"
# Manage services like mysql
tap "homebrew/services"
# skhd, yabai
tap "koekeishiya/formulae"
# Keep bash up to date...macOS ships with 3.5
brew "bash"
brew "coreutils"
brew "fzf", args: ["HEAD"]
brew "gawk"
brew "git"
brew "python@3.12"
brew "htop"
brew "jq"
brew "webp"
brew "lsusb"
brew "llvm"
brew "mas"
brew "minicom"
brew "mysql", restart_service: true
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk@11"
brew "pyenv"
brew "ripgrep"
brew "rust"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "aldente"
cask "arc"
cask "balenaetcher"
cask "caffeine"
cask "calibre"
cask "discord"
cask "font-hack-nerd-font"
cask "fork"
cask "hiddenbar"
cask "iterm2"
cask "lulu"
cask "obsidian"
cask "raycast"
cask "transmission"
cask "ultimaker-cura"
cask "visual-studio-code"
cask "vlc"
