# Keep bash up to date...macOS ships with 3.5
# Manage services like mysql
# font-hack
# skhd, yabai
#brew "gawk"
brew "bash"
brew "btop"
brew "coreutils"
brew "fastfetch"
brew "fzf", args: ["HEAD"]
brew "git"
brew "htop"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "mas"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk@11"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.12"
brew "ripgrep"
brew "rustup"
brew "starship"
brew "tmux"
brew "tree"
brew "webp"
brew "wget"
brew "zig"
brew "stow"
brew "zoxide"
cask "aldente"
cask "arc"
cask "caffeine"
cask "discord"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-for-powerline"
cask "fork"
cask "hiddenbar"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "steermouse"
cask "vlc"
cask "wezterm"
cask "zed"
mas "Bitwarden", id: 1352778147
mas "Monodraw", id: 920404675
mas "Remote Desktop", id: 409907375
mas "TestFlight", id: 899247664
mas "Wipr", id: 1320666476
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
