tap "homebrew/bundle"
# font-hack
tap "homebrew/cask-fonts"
# Manage services like mysql
tap "homebrew/services"
# skhd, yabai
tap "koekeishiya/formulae"
# Keep bash up to date...macOS ships with 3.5
brew "bash"
brew "coreutils"
brew "fzf", args: ["HEAD"]
brew "gawk"
brew "git"
brew "python3"
brew "htop" # Monitor system
brew "jq" # Parse JSON from CLI, for yabai
brew "webp"
brew "lsusb" # Tell what devices are connected easily
brew "llvm"
brew "mas"
brew "minicom"
brew "mutt"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk@11"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "rustup-init" # Rust toolchain installer
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "aldente"
cask "arc"
cask "balenaetcher"
cask "caffeine"
cask "calibre"
cask "discord"
cask "font-hack-nerd-font"
cask "font-sf-mono-for-powerline"
cask "font-sf-mono"
cask "fork"
cask "hiddenbar"
cask "lulu"
cask "obsidian"
cask "raycast"
cask "transmission"
cask "ultimaker-cura"
cask "wezterm"
cask "vlc"
cask "zed"
